planning_audit/developing_an_annual_audit_plan.org
#+title: Developing An Annual Audit Plan
#+author:gabriel

Formal document datailing audit scope, criteria, objectives, resources and schedule
*scope* --> o que será auditado, servindo como fonte mútua de verdade

*criteria* --> normas, controles e locais

*resources* --> funções da equipe de auditoria e recursos necessários da entidade auditada (por exemplo, espaços para reuniões, contatos)

*schedule* --> cronograma da auditoria, reunião por reunião, para expectativas claras

* step 1 - establish audit objectives and define scope
- consultar o programa de auditoria para confirmar os critérios (normas, controles, locais etc.)
- alinhar os critérios de auditoria com o escopo definido pela entidade auditada para evitar imprecisões

*example objectives* -->
- para a etapa 1, verificar a prontidão para a etapa 2
- revisar as ações corretivas para não conformidades anteriores
- confirmar a conformidade do SGSI com a ISO 27001 e outros requisitos

* step 2 - perform a risk analysis ahead of the audit
- priorizar as áreas de alto risco com base nos riscos do setor, não conformidades anteriores ou novas Produtos/Serviços
- Aborda riscos operacionais, como desafios de auditoria remota, conflitos regionais ou restrições de recursos do auditado
- Conflitos de agendamento

* step 3 - establish necessary resources
- Formar a equipe de auditoria e atribuir funções
- Confirmar os recursos fornecidos pelo auditado, como: equipamentos audiovisuais, salas de reunião, disponibilidade das partes interessadas, acesso às instalações e contatos locais

* step 4 - develop the audit schedule
Defina claramente o cronograma, incluindo:
- Data e horário da reunião de abertura
- Sessões de auditoria específicas para as principais partes interessadas
- Data e horário da reunião de encerramento
- Prazos para envio de evidências
- Garantir o consenso mútuo sobre o cronograma, com flexibilidade para imprevistos


* tips for a successful audit plan
*get ahead of it*
- share the audit plan early to give the auditee time to review and address scope or scheduling issues

*be flexible*
- build buffer time into sessions for unexpected audit trails or contingencies

*get stakeholder buy-in*
- ensure auditee approval of the plan and coordination with required participants
