planning_audit/developing_an_annual_audit_plan.md

# Table of Contents

1.  [step 1 - establish audit objectives and define scope](#org898a767)
2.  [step 2 - perform a risk analysis ahead of the audit](#org9c61e72)
3.  [step 3 - establish necessary resources](#orgae15525)
4.  [step 4 - develop the audit schedule](#org7df2859)
5.  [tips for a successful audit plan](#org2f62276)

Formal document datailing audit scope, criteria, objectives, resources and schedule
**scope** &#x2013;> o que será auditado, servindo como fonte mútua de verdade

**criteria** &#x2013;> normas, controles e locais

**resources** &#x2013;> funções da equipe de auditoria e recursos necessários da entidade auditada (por exemplo, espaços para reuniões, contatos)

**schedule** &#x2013;> cronograma da auditoria, reunião por reunião, para expectativas claras


<a id="org898a767"></a>

# step 1 - establish audit objectives and define scope

-   consultar o programa de auditoria para confirmar os critérios (normas, controles, locais etc.)
-   alinhar os critérios de auditoria com o escopo definido pela entidade auditada para evitar imprecisões

**example objectives** &#x2013;>

-   para a etapa 1, verificar a prontidão para a etapa 2
-   revisar as ações corretivas para não conformidades anteriores
-   confirmar a conformidade do SGSI com a ISO 27001 e outros requisitos


<a id="org9c61e72"></a>

# step 2 - perform a risk analysis ahead of the audit

-   priorizar as áreas de alto risco com base nos riscos do setor, não conformidades anteriores ou novas Produtos/Serviços
-   Aborda riscos operacionais, como desafios de auditoria remota, conflitos regionais ou restrições de recursos do auditado
-   Conflitos de agendamento


<a id="orgae15525"></a>

# step 3 - establish necessary resources

-   Formar a equipe de auditoria e atribuir funções
-   Confirmar os recursos fornecidos pelo auditado, como: equipamentos audiovisuais, salas de reunião, disponibilidade das partes interessadas, acesso às instalações e contatos locais


<a id="org7df2859"></a>

# step 4 - develop the audit schedule

Defina claramente o cronograma, incluindo:

-   Data e horário da reunião de abertura
-   Sessões de auditoria específicas para as principais partes interessadas
-   Data e horário da reunião de encerramento
-   Prazos para envio de evidências
-   Garantir o consenso mútuo sobre o cronograma, com flexibilidade para imprevistos


<a id="org2f62276"></a>

# tips for a successful audit plan

**get ahead of it**

-   share the audit plan early to give the auditee time to review and address scope or scheduling issues

**be flexible**

-   build buffer time into sessions for unexpected audit trails or contingencies

**get stakeholder buy-in**

-   ensure auditee approval of the plan and coordination with required participants

